Tekla Open API Reference for Tekla Structures 2025
PolyBeam.Type Property
 Gets the read only type of the polybeam. The default type for a new polybeam instance is beam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolyBeam.PolyBeamTypeEnum Type { get; }
Public ReadOnly Property Type As PolyBeam.PolyBeamTypeEnum
	Get
Property Value
Type: PolyBeam.PolyBeamTypeEnum
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace